🚀&nbsp; env0 had composed a PR Plan for environment [My First Project / staging ](https://app.env0.com/p/f249f379-6361-4103-834b-c4232af1a899/environments/9696f998-131b-48ce-aad8-772e82dfab39):
```
Plan: 2 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:


  # digitalocean_container_registry.registry will be created
+   resource "digitalocean_container_registry" "registry" {
+       created_at             = (known after apply)
+       endpoint               = (known after apply)
+       id                     = (known after apply)
+       name                   = "pdfsvc-registry"
+       region                 = (known after apply)
+       server_url             = (known after apply)
+       storage_usage_bytes    = (known after apply)
+       subscription_tier_slug = "starter"
    }

  # digitalocean_container_registry_docker_credentials.registry_credentials will be created
+   resource "digitalocean_container_registry_docker_credentials" "registry_credentials" {
+       credential_expiration_time = (known after apply)
+       docker_credentials         = (sensitive value)
+       expiry_seconds             = 1576800000
+       id                         = (known after apply)
+       registry_name              = "pdfsvc-registry"
+       write                      = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```
</details>


```
There are no cost estimation changes
```

[Full PR Plan logs on env0](https://app.env0.com/p/f249f379-6361-4103-834b-c4232af1a899/environments/9696f998-131b-48ce-aad8-772e82dfab39/deployments/2aad69c4-60e6-4eda-a485-3f52853b1fab)